#ifndef __SRAM_H
#define __SRAM_H	
#include "stm32f4xx.h"

//使用NOR/SRAM的 Bank1.sector3,地址位HADDR[27,26]=10 
//对IS61LV25616/IS62WV25616,地址线范围为A0~A17 
//对IS61LV51216/IS62WV51216,地址线范围为A0~A18
#define Bank1_SRAM3_ADDR    ((u32)(0x68000000))	

/************************************************************************
** 函数名称: FSMC_SRAM_Init								
** 函数功能: 初始化外部SRAM				
** 入口参数: 无
** 出口参数: 无
** 备    注: FSMC相关IO初始化和FSMC配置
************************************************************************/
void FSMC_SRAM_Init(void);

/************************************************************************
** 函数名称: FSMC_SRAM_WriteBuffer								
** 函数功能: 向外部SRAM写入指定长度数据				
** 入口参数: u8* pBuffer:字节指针
**           u32 WriteAddr:要写入的起始地址
**           u32 n:要写入的字节数
** 出口参数: 无
** 备    注: 
************************************************************************/
void FSMC_SRAM_WriteBuffer(u8* pBuffer,u32 WriteAddr,u32 n);

/************************************************************************
** 函数名称: FSMC_SRAM_ReadBuffer								
** 函数功能: 从外部SRAM读出指定长度数据				
** 入口参数: u8* pBuffer:字节指针
**           u32 WriteAddr:要读出的起始地址
**           u32 n:要读取的字节数
** 出口参数: 无
** 备    注: 
************************************************************************/
void FSMC_SRAM_ReadBuffer(u8* pBuffer,u32 ReadAddr,u32 n);

#endif

